{"id": "1", "author": "Michelle Kisner", "fullText": "It's a shame that the weak writing undermines The Creator so much, as there are some intriguing concepts that could have been compelling if executed better. For the most part, it's a mishmash of other movies with not much to say on its own."}
{"id": "2", "author": "John McDonald", "fullText": "Although 'New Asia' is America's enemy, we are encouraged to transfer our sympathies in that direction. Yet the abiding vision of Asian life is a mass of touristic clichés seen through western eyes."}
{"id": "3", "author": "Chris Sawin", "fullText": "The Creator has astonishing visuals, but that's where its charm ends. While the performances are strong, thrilling elements of the film swap actual excitement for a more traditional science fiction film that pays tribute to its influences and little else."}
{"id": "4", "author": "JD Duran", "fullText": "The Creator is incredibly immersive from a visual and world building perspective, however it leaves a lot to be desired with its writing."}
{"id": "5", "author": "Connor Petrey", "fullText": "The Creator is a gorgeous feature in all the ways that matter and it's certainly a sci-fi epic that shouldn't be missed in a year that's severely lacking the charm of an old-fashioned blockbuster!"}
{"id": "6", "author": "James Hanton", "fullText": "Sincere in its execution and with at times a mystifying beauty, as well as some serious thrills, Edwards has yet again rewarded audiences with his leap of faith."}
{"id": "7", "author": "Emmanuel Noisette", "fullText": "The Creator is a thought-provoking, visually memorizing, sci-fi journey that'll tantalize the imagination. Director Gareth Edwards put together an intellectually stimulating film that really challenges audiences to wrestle with profound questions."}
{"id": "8", "author": "Sandra Hall", "fullText": "Writer-director Gareth Edwards and his collaborator, Chris Weitz, have crafted a script which tries so hard to cover all the ethical dilemmas posed by the rise of artificial intelligence that I'm not sure what it's meant to be saying."}
{"id": "9", "author": "Wikipedia", "fullText": "The Creator is a 2023 American science fiction action film produced and directed by Gareth Edwards, who co-wrote the screenplay with Chris Weitz. The film stars John David Washington, Gemma Chan, Ken Watanabe, Sturgill Simpson and Allison Janney. Set in 2070, 15 years after a nuclear detonation in Los Angeles and a war against artificial intelligence, an ex-special forces agent is recruited to hunt down and kill the 'Creator,' who has developed a mysterious weapon with the power to end the war."}
{"id": "10", "author": "Wikipedia", "fullText": "Development on the film began in November 2019, when Gareth Edwards signed on to direct and write an untitled science fiction project for New Regency to produce, along with Edwards' Rogue One: A Star Wars Story (2016) co-producer Kiri Hart serving as producer. A test shoot and location scouting was conducted that year, with Edwards using it as the opportunity to envision the look of the film. He described the process: 'I took a camera and a 1970s anamorphic lens, we went location-scouting in Vietnam, Cambodia, Japan, Indonesia, Thailand, and Nepal. Our whole plan was just to go to the greatest locations in the world, because the cost of a flight is way less than the cost of building a set. We were going to hopscotch around the world and shoot this film, then layer in the science-fiction on top afterwards. If our film is trying to achieve something visually, it's trying to feel real in terms of science-fiction.'"}
